Relation/Mind.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Intensional Theory of Mind</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-29 Thu"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Intensional Theory of Mind</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Motivation: Leibniz-Russell Theory </a></li>
<li><a href="#sec-2">2 Intensional Theory of Mind </a>
<ul>
<li><a href="#sec-2.1">2.1 Mind </a></li>
<li><a href="#sec-2.2">2.2 The Oge </a></li>
<li><a href="#sec-2.3">2.3 Gods </a></li>
<li><a href="#sec-2.4">2.4 Rational Mind </a></li>
</ul>
</li>
<li><a href="#sec-3">3 References </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Motivation: Leibniz-Russell Theory </h2>
<div class="outline-text-2" id="text-1">

<p>Source: <a href="http://en.wikipedia.org/wiki/User:Helier_Robinson/Leibniz-Russell_theory_of_perception">http://en.wikipedia.org/wiki/User:Helier_Robinson/Leibniz-Russell_theory_of_perception</a>
</p>
<p>
Although logically simple this theory is psychologically difficult because of its anti-common-sensical nature; but this difficulty is worth enduring because of the solutions the theory provides to all known philosophical problems of perception.
</p>
<p>
The theory arises from the contention that all that we perceive around us is not reality (as common sense demands) but images of reality. Because common sense is being impugned it is worth considering some arguments for each side of this question.
</p>
<p>
People generally agree that perception is a process of information transfer from real objects to images thereof, inside the brain of the perceiver. Common sense has it that the real objects are outside the perceiver's head, public, and material, while the images are inside the perceiver's head, private, and mental. Since what we perceive is external, public, and material, common sense considers all of it to be real.
</p>
<p>
Against this view are three arguments. The first is that the data that arrives in the perceiver's consciousness takes the form of sensations: tactile sensations (rough, smooth, hard, soft, hot, cold, etc.), colors in various shapes, sounds, tastes, and smells. Since every object that we perceive in the world around us is a structure of sensations, and the whole perceived world is a structure of such objects, the world that we each perceive must be inside our heads, private and mental.
</p>
<p>
Second is the argument that no perceived object is wholly free of illusion, so no perceived object is real, since no illusion is real. (Can you point to any object that is wholly free of illusion? And if you think you can, can you say how you know it to be so?)
</p>
<p>
Third is the argument that everyone's perceived world differs qualitatively from everyone else's because of viewpoint and perceptual idiosyncracies; and each of these worlds differs qualititatively from the real world because of illusion; and since qualitative difference entails quantitative difference there must be as many perceived worlds as there are percievers, and none of these perceived worlds are the real world. (The proof that qualitative difference entails quantitative difference is simple: whatever A and B may be, if they differ qualitatively then there is some quality, Q, that A has and B does not have (or vice versa); if A nd B are one then one thing is at once Q and not-Q, which is impossible &mdash; so A and B are two.)
</p>
<p>
The resolution of these two conflicting positions &mdash; the Leibniz-Russell theory &mdash; comes about with the observation that one's own body is a perceived object, composed of sensations, and thus an image of one's own real body. So the perceiver has two heads: a real head and an image head. The real head is made of animate cells and the image head is made of sensations. Outside the real head is the rest of the real world, the local part of which is imaged into the real brain as structures of sensations, all of which are outside the image head and all of which appear to be material and public. This publicity is publicity by similarity, as the contents of one television program, on different sets, are public by similarity &mdash; as opposed to the publicity by identity that is assumed in common sense.
</p>
<p>
Although it is not necessary to attend to this theory in daily living, any more than one attends to the speed at which the Earth is going round the Sun, the theory is very important in philosophy. Not only does it solve problems of perception, such as how illusions such as the railroad lines meeting in the distance are outside our heads, public, and material; but it is also valuable in philosophy of science. One of the problems of philosophy of science is the question of why there are two kinds of science, empirical and theoretical; and why empirical science deals with perceptible things and theoretical science with strictly imperceptible things. ('Theoretical' means 'non-empirical'.) Empirical science tries to describe the public features of empirical (image) worlds while theorteical science tries to describe the real world. Since in the process of perception real objects cause images of themselves in empirical worlds; and since to describe causes is to explain their effects, it follows that theoretical science explains what empirical science describes. This theory also is able to explain how theories can predict empirical novelties, as Maxwell's equations predicted radio.
</p>
<p>
The best treatment of the theory in Russell's works is in Part 3 of Human Knowledge, Allen and Unwin, London, 1948. Russell attributed the theory to Leibniz, where it can be found in his Monadology, included in Loemker, Gottfried Wilhelm Leibniz, Philosophical Papers and Letters, Chicago Univ. Press, 1956. However Leibniz, who feared public opprobium, did not draw attention to the theory, nor to its power.
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Intensional Theory of Mind </h2>
<div class="outline-text-2" id="text-2">

<p>Notes on the Intensional Theory of Mind presented by Helier Robinson in his 
work <i>Relation Philosophy of Mathematics, Science, and Mind</i>.
</p>
<p>
The works consists of four chapters
</p><ul>
<li>
Mind
</li>
<li>
The Oge
</li>
<li>
Gods
</li>
<li>
Rational Mind

</li>
</ul>

<p>There are three agents in the <b>noumenal mind</b>
</p><ul>
<li>
Ego (page 148)
</li>
<li>
Oge (page 161)
</li>
<li>
Psychohelios (page 185)

</li>
</ul>

<p>Three ambiguities (page 185)
</p><ul>
<li>
Psy &lt;-&gt; Noumenal World (Ambiguity of Reality)
</li>
<li>
Ego &lt;-&gt; Empirical Body (Ambiguity of Self)
</li>
<li>
Oge &lt;-&gt; Empirical Society (Ambiguity of Society)

</li>
</ul>

</div>
