Relation/Mind.org
** Mind
An *atomic idea* is a neural switching (0/1) in a noumenal brain.

Two principles:
- *MIND HEKERGY PRINCIPLE*
- *LIKE-ATTRACTS-LIKE-AND-REPELS-UNLIKE* (LALRU)

A *NOUMENAL MIND* is all the atomic ideas in a noumenal brain,
plus all innate ideas, plus all data that are brought in by
the noumenal afferent nerves, plus all that emerges cascadingly
out of these.

Two basic processes within a *NOUMENAL MIND*
- *MAPPING*
- *BONDING*

A *NOUMENAL SENSATION* (or *MID-SENSATION*) is a level-two
structure of atomic ideas, brought into the noumenal mind
by noumenal perception.

A *MID-OBJECT* is a level-three structure in a noumenal mind,
a structure of noumenal sensations.

A *MID-WORLD* is a complete structure of mid-objects. 

The *EGO* is a structure of *EGO-MEMORIES*, mutually
attracted by LAL because of their common feature of
a *MID-MEMORY* of the *MID-BODY*.

An *EMPIRICAL SENSATION* is the LAL reaction in the ego
to a mid-sensation; it is a poor image of a mid-sensation,
mapped by LAL.

An *EMPIRICAL OBJECT* is the LAL reaction in the ego to a
mid-object, hence it is an image of that mid-object.

In short:
- A mid-object is a structure of mid-sensations
- An empirical object is a structure of empirical sensations

An *EMPIRICAL WORLD* is a structure of empirical objects, an
image of a mid-world; and thereby, transitively, of a portion
the noumenal world.

The *AWARENESS* or *CONSCIOUSNESS* of the ego is the
presence of empirical objects within the ego; they are the objects
of this consciousness.

The ego is conscious, over time, of a series of transient empirical worlds.

This consciousness is empirical perception.

Any empirical world, empirically perceived at any one time by an ego,
is entirely within the structure of the ego.

Beyond the empirical blue sky are the outer limits of the ego.

Beyond those outer limits is the inside surface of the ego's noumenal skull.

The LAL forces that produce the consciousness of the ego
depend upon the structure of the ego, and the hekergy of the 
ideas within it, as well as upon the mid-objects that are 
the immediate causes of the consciousness--in accordance
with the LAL formula.

The *ATTITUDE* of the ego is the effect of its permanent
structure on its consciousness.

*SELFISHNESS* is the attitude of the ego that results from
the mind hekergy principle.

*ATTENTION* is the ego's focussing of its consciousness.

Attention focusses on three kinds of content of consciousness:
- Sensations
- Relations 
- Hekergies

*ABSOLUTE VALUES* are noumenal values, actual hekergies

*EMPIRICAL VALUES* or *HUMAN VALUES* are the ego's 
consciousness of images of absolute values.

Consciousness is usually dynamic: attention does not remain
static for long.

*FEELINGS* are the ego's dynamic attention to values,
as opposed to *THOUGHTS*, which are its dynamic attention
to sensations and relations.

A *GOAL* of the ego is any possibility of its own hekergy
increase of which the ego is conscious.

*PLEASURE* is the ego's consciousness of hekergy increase
and *PAIN* is its consciousness of hekergy decrease.

An *EMPIRICAL MEMORY* is the ego's consciousness of a 
mid-memory.

A *CONCRETE QUALITY* is any empirical sensation.

A *CONCRETE IDEA* is an empirical memory of a concrete
quality, or a structure thereof.

A structure of concrete qualities is an empirical object.

Concrete qualities are the smallest elements of empirical
perception, as opposed to atomic ideas, which are the
smallest elements of the noumenal world.

Empirically, a sensation is a level-one structure, an
object is a level-two structure and a world is a level-
three structure.

Empirical Sensation -> Level-One
Empirical Object    -> Level-Two
Empirical World     -> Level-Three

An *ABSRACT IDEA* is any intensional meaning in the 
noumenal mind.

The ego may manipulate ideas at its periphery by appropriate
focussing of its consciousness. Its consciousness of these
processes is either imagination or thought.

*IMAGINATION* is the ego's manipulation of, and consciousness of,
concrete ideas.

*THOUGHT* is the ego's manipulation of, and consciousness
of, abstract ideas.

A *PROPOSITION* is a structure of abstract and/or concrete
ideas.

A *BELIEF*, by the ego, is a proposition that is incorporated
into the structure of the ego, by LAL.

The ego consists of mid-memories and mid-beliefs, and also
of innate ideas. This is quite plausible, in that, once it
has speech, any ego might say existentially "I am what I
have inherited, experienced, and done, and what I believe."

A *PREJUDICE* is a structure consisting of a belief and
supporting evidence for that belief; by LAL the belief
attracts evidence in favour of itself (that is, /like/
itself) and repels evidence against itself (that is,
/unlike/ itself).

*CLASSIFICATION* is the process of collecting similar ideas
into extensional sets, by LAL.

*RECOGNITION* results from the comparison of a present
perception with a memory, such that the comparison yields
similarity; the memory is attracted to the present perception
by LAL and the recognition is consciousness of the similarity.

A *MOTOR-IDEA* is a mid-idea that may be sent down the
efferent nervous system so as to produce a specific movement
of muscles in the noumenal body.

By analogy with computer theory, motor-ideas are instructions
rather than data, yet consist of the same informational
stuff: structures of atomic ideas.

An *ACTION-POINT* is the point in the noumenal mind,
at which a motor-idea is delivered to a set of efferent
nerves.

Efferent or motor nerves, carry nerve impulses AWAY from the central nervous system

Afferent or sensory nerves, carry nerve impulses TOWARDS the central nervous system

*ACTION* by the ego is control of the noumenal body by means
of motor-ideas. The movement of motor-ideas to their action
points by the ego is the *WILLING* of that action by the ego.

A *WORD* is a structure of noumenal and empirical ideas
bonded together, consisting of a memory of the sound of the
word, the motor ideas to produce a similar sound, and a 
noumenal idea that is the meaning of the word; it usually
also has bonded to it a memory of a written word and the
motor ideas to produce a similar written word; and it may
have similar structures bonded to it that are synonyms,
and special symbols or foreign words having the same
meaning.

The *CONCRETE MEANING* of a word is extensional-any,
one member of that class of concrete memories which
is the meaning of the word.

A *PROPER NAME* is a word bonded to a single object.

A *CONCRETE NAME* is a word bonded to a concrete meaning.

A *CONCEPT* is a word bonded to an abstract idea.

*GRAMMAR* consists of rules that relate words and the
meanings of words.

A *SENTENCE* is a set of grammatically related words.

*PURE THOUGHT* is manipulation of abstract ideas--
intensional meanings--without associated language.

*ORDINARY THOUGHT* is manipulation of abstract ideas
with the aid of language--manipulation of concepts.

*CALCULATION* is algorithmic thought: manipulation of words
without their associated abstract ideas, in accordance
with rules derived from ordinary thought.

*DISCRIMINATION* is consciousness of the results of special
mappings, such as the following:

A *PATCH MAPPING* is a mapping of a minimal area of a 
concrete original, just large enough to be within
consciousness.

A *BOUNDARY MAPPING* is a mapping of boundaries--of
contiguous dissimilarities.

A *SCALE MAPPING* is a mapping with uniform enlargement
or diminution.

The *MATERIAL* is everything in the consciousness of the ego
that is external, public, reperceptible, and causally coherent.

The *MENTAL* is everything in the consciousness of the ego
that is not material.

*VANITY* is a false belief that the hekergy of the ego is
greater than its actual value.

*RATIONALISATION* is the manufacture, by the ego, of a false
belief that supports vanity.

