Relation/Mind.html

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Mind </h3>
<div class="outline-text-3" id="text-2.1">

<p>An <b>atomic idea</b> is a neural switching (0/1) in a noumenal brain.
</p>
<p>
Two principles:
</p><ul>
<li>
<b>MIND HEKERGY PRINCIPLE</b>
</li>
<li>
<b>LIKE-ATTRACTS-LIKE-AND-REPELS-UNLIKE</b> (LALRU)

</li>
</ul>

<p>A <b>NOUMENAL MIND</b> is all the atomic ideas in a noumenal brain,
plus all innate ideas, plus all data that are brought in by
the noumenal afferent nerves, plus all that emerges cascadingly
out of these.
</p>
<p>
Two basic processes within a <b>NOUMENAL MIND</b>
</p><ul>
<li>
<b>MAPPING</b>
</li>
<li>
<b>BONDING</b>

</li>
</ul>

<p>A <b>NOUMENAL SENSATION</b> (or <b>MID-SENSATION</b>) is a level-two
structure of atomic ideas, brought into the noumenal mind
by noumenal perception.
</p>
<p>
A <b>MID-OBJECT</b> is a level-three structure in a noumenal mind,
a structure of noumenal sensations.
</p>
<p>
A <b>MID-WORLD</b> is a complete structure of mid-objects. 
</p>
<p>
The <b>EGO</b> is a structure of <b>EGO-MEMORIES</b>, mutually
attracted by LAL because of their common feature of
a <b>MID-MEMORY</b> of the <b>MID-BODY</b>.
</p>
<p>
An <b>EMPIRICAL SENSATION</b> is the LAL reaction in the ego
to a mid-sensation; it is a poor image of a mid-sensation,
mapped by LAL.
</p>
<p>
An <b>EMPIRICAL OBJECT</b> is the LAL reaction in the ego to a
mid-object, hence it is an image of that mid-object.
</p>
<p>
In short:
</p><ul>
<li>
A mid-object is a structure of mid-sensations
</li>
<li>
An empirical object is a structure of empirical sensations

</li>
</ul>

<p>An <b>EMPIRICAL WORLD</b> is a structure of empirical objects, an
image of a mid-world; and thereby, transitively, of a portion
the noumenal world.
</p>
<p>
The <b>AWARENESS</b> or <b>CONSCIOUSNESS</b> of the ego is the
presence of empirical objects within the ego; they are the objects
of this consciousness.
</p>
<p>
The ego is conscious, over time, of a series of transient empirical worlds.
</p>
<p>
This consciousness is empirical perception.
</p>
<p>
Any empirical world, empirically perceived at any one time by an ego,
is entirely within the structure of the ego.
</p>
<p>
Beyond the empirical blue sky are the outer limits of the ego.
</p>
<p>
Beyond those outer limits is the inside surface of the ego's noumenal skull.
</p>
<p>
The LAL forces that produce the consciousness of the ego
depend upon the structure of the ego, and the hekergy of the 
ideas within it, as well as upon the mid-objects that are 
the immediate causes of the consciousness&ndash;in accordance
with the LAL formula.
</p>
<p>
The <b>ATTITUDE</b> of the ego is the effect of its permanent
structure on its consciousness.
</p>
<p>
<b>SELFISHNESS</b> is the attitude of the ego that results from
the mind hekergy principle.
</p>
<p>
<b>ATTENTION</b> is the ego's focussing of its consciousness.
</p>
<p>
Attention focusses on three kinds of content of consciousness:
</p><ul>
<li>
Sensations
</li>
<li>
Relations 
</li>
<li>
Hekergies

</li>
</ul>

<p><b>ABSOLUTE VALUES</b> are noumenal values, actual hekergies
</p>
<p>
<b>EMPIRICAL VALUES</b> or <b>HUMAN VALUES</b> are the ego's 
consciousness of images of absolute values.
</p>
<p>
Consciousness is usually dynamic: attention does not remain
static for long.
</p>
<p>
<b>FEELINGS</b> are the ego's dynamic attention to values,
as opposed to <b>THOUGHTS</b>, which are its dynamic attention
to sensations and relations.
</p>
<p>
A <b>GOAL</b> of the ego is any possibility of its own hekergy
increase of which the ego is conscious.
</p>
<p>
<b>PLEASURE</b> is the ego's consciousness of hekergy increase
and <b>PAIN</b> is its consciousness of hekergy decrease.
</p>
<p>
An <b>EMPIRICAL MEMORY</b> is the ego's consciousness of a 
mid-memory.
</p>
<p>
A <b>CONCRETE QUALITY</b> is any empirical sensation.
</p>
<p>
A <b>CONCRETE IDEA</b> is an empirical memory of a concrete
quality, or a structure thereof.
</p>
<p>
A structure of concrete qualities is an empirical object.
</p>
<p>
Concrete qualities are the smallest elements of empirical
perception, as opposed to atomic ideas, which are the
smallest elements of the noumenal world.
</p>
<p>
Empirically, a sensation is a level-one structure, an
object is a level-two structure and a world is a level-
three structure.
</p>
<p>
Empirical Sensation -&gt; Level-One
Empirical Object    -&gt; Level-Two
Empirical World     -&gt; Level-Three
</p>
<p>
An <b>ABSRACT IDEA</b> is any intensional meaning in the 
noumenal mind.
</p>
<p>
The ego may manipulate ideas at its periphery by appropriate
focussing of its consciousness. Its consciousness of these
processes is either imagination or thought.
</p>
<p>
<b>IMAGINATION</b> is the ego's manipulation of, and consciousness of,
concrete ideas.
</p>
<p>
<b>THOUGHT</b> is the ego's manipulation of, and consciousness
of, abstract ideas.
</p>
<p>
A <b>PROPOSITION</b> is a structure of abstract and/or concrete
ideas.
</p>
<p>
A <b>BELIEF</b>, by the ego, is a proposition that is incorporated
into the structure of the ego, by LAL.
</p>
<p>
The ego consists of mid-memories and mid-beliefs, and also
of innate ideas. This is quite plausible, in that, once it
has speech, any ego might say existentially "I am what I
have inherited, experienced, and done, and what I believe."
</p>
<p>
A <b>PREJUDICE</b> is a structure consisting of a belief and
supporting evidence for that belief; by LAL the belief
attracts evidence in favour of itself (that is, <i>like</i>
itself) and repels evidence against itself (that is,
<i>unlike</i> itself).
</p>
<p>
<b>CLASSIFICATION</b> is the process of collecting similar ideas
into extensional sets, by LAL.
</p>
<p>
<b>RECOGNITION</b> results from the comparison of a present
perception with a memory, such that the comparison yields
similarity; the memory is attracted to the present perception
by LAL and the recognition is consciousness of the similarity.
</p>
<p>
A <b>MOTOR-IDEA</b> is a mid-idea that may be sent down the
efferent nervous system so as to produce a specific movement
of muscles in the noumenal body.
</p>
<p>
By analogy with computer theory, motor-ideas are instructions
rather than data, yet consist of the same informational
stuff: structures of atomic ideas.
</p>
<p>
An <b>ACTION-POINT</b> is the point in the noumenal mind,
at which a motor-idea is delivered to a set of efferent
nerves.
</p>
<p>
Efferent or motor nerves, carry nerve impulses AWAY from the central nervous system
</p>
<p>
Afferent or sensory nerves, carry nerve impulses TOWARDS the central nervous system
</p>
<p>
<b>ACTION</b> by the ego is control of the noumenal body by means
of motor-ideas. The movement of motor-ideas to their action
points by the ego is the <b>WILLING</b> of that action by the ego.
</p>
<p>
A <b>WORD</b> is a structure of noumenal and empirical ideas
bonded together, consisting of a memory of the sound of the
word, the motor ideas to produce a similar sound, and a 
noumenal idea that is the meaning of the word; it usually
also has bonded to it a memory of a written word and the
motor ideas to produce a similar written word; and it may
have similar structures bonded to it that are synonyms,
and special symbols or foreign words having the same
meaning.
</p>
<p>
The <b>CONCRETE MEANING</b> of a word is extensional-any,
one member of that class of concrete memories which
is the meaning of the word.
</p>
<p>
A <b>PROPER NAME</b> is a word bonded to a single object.
</p>
<p>
A <b>CONCRETE NAME</b> is a word bonded to a concrete meaning.
</p>
<p>
A <b>CONCEPT</b> is a word bonded to an abstract idea.
</p>
<p>
<b>GRAMMAR</b> consists of rules that relate words and the
meanings of words.
</p>
<p>
A <b>SENTENCE</b> is a set of grammatically related words.
</p>
<p>
<b>PURE THOUGHT</b> is manipulation of abstract ideas--
intensional meanings&ndash;without associated language.
</p>
<p>
<b>ORDINARY THOUGHT</b> is manipulation of abstract ideas
with the aid of language&ndash;manipulation of concepts.
</p>
<p>
<b>CALCULATION</b> is algorithmic thought: manipulation of words
without their associated abstract ideas, in accordance
with rules derived from ordinary thought.
</p>
<p>
<b>DISCRIMINATION</b> is consciousness of the results of special
mappings, such as the following:
</p>
<p>
A <b>PATCH MAPPING</b> is a mapping of a minimal area of a 
concrete original, just large enough to be within
consciousness.
</p>
<p>
A <b>BOUNDARY MAPPING</b> is a mapping of boundaries&ndash;of
contiguous dissimilarities.
</p>
<p>
A <b>SCALE MAPPING</b> is a mapping with uniform enlargement
or diminution.
</p>
<p>
The <b>MATERIAL</b> is everything in the consciousness of the ego
that is external, public, reperceptible, and causally coherent.
</p>
<p>
The <b>MENTAL</b> is everything in the consciousness of the ego
that is not material.
</p>
<p>
<b>VANITY</b> is a false belief that the hekergy of the ego is
greater than its actual value.
</p>
<p>
<b>RATIONALISATION</b> is the manufacture, by the ego, of a false
belief that supports vanity.
</p>
</div>

</div>
