Relation/Mind.org
** The Oge
Among the irrational features of mind which prevent knowledge
of the best of all intensional mathematical systems are:

- Internal Conflict 
- Social Pressures

Both of these require the concept of oge for their
explanation.

The *OGE* (rhymes with /bogey/) is a second agent in the
noumenal mind which grows out of mid-memories of other
people; as such it represents, and acts on behalf of, society.

*APPROVAL* is evaluation of an action as hekergy increasing;
*DISAPPROVAL* is evaluation of it as hekergy decreasing.

*INTROJECTION* is the incorporation of a proposition into
the oge, thereby making it an oge-belief, as a result of
another person asserting this proposition in the hearing
of the ego.

The *MORAL* is any increase in the hekergy of society,
and hence of the oge.

*GUILT*, *SHAME*, *EMBARASSMENT* and *CONSCIENCE* are
feelings produced in the ego by the oge.

*CONFLICT* occurs when there are two agents having
mutually exclusive goals in a common situation.

An *OGE-INHIBITIION* is the prevention, by the oge,
of an action willed by the ego. An *EGO-INHIBITION*
is the prevention, by the ego, of an action willed
by the oge. A *TABOO* is a very strong oge-inhibition.

An *OGE-COMPULSION* is the forcing, by the oge, of
an action against the will of the ego; an 
*EGO-COMPULSION* is the forcing, by the ego, of
an action against the will of the oge.

An *OGE-PERSON* is a set of mid-memories of a
particular noumenal person, in the oge.

*GOOD* is hekergy increase.

*EVIL* is hekergy decrease.

*LOVE* is a willingness to raise the hekergy of
another person, unconditionally.

*HATE* is a willingness to lower the hekergy of
another person, unconditionally.

The *TOP (HIGH) EGO* is the good pole of the ego.

The *BOTTOM (LOW) EGO* the evil pole of the ego.

*MATURATION* of agents is hekergy increase.

*IDENTIFICATION* occurs when an oge-person, or a
group of them, becomes joined to the ego.

*INCLINATION-DUTY CONFLICT* is conflict between the
ego and the public portion of the oge.

*NEUROTIC CONFLICT* is conflict between the ego and
private portions of the oge.

*NOUMENAL POSSESSION* (*OWNERSHIP*) is an emergent
relation between a noumenal person or group of
noumenal people (the owner/s), and a noumenal object,
characterised by control of the object by the owner,
and lack of such control by non-owners.

*NOUMENAL WEALTH* is the emergent relation between
the hekergy of a noumenal object and a noumenal need
of the possessor of the wealth.

*MATERIAL WEALTH* is the emergent relation between the
hekergy of a material--that is,empirical--object and
an empirical need of the possessor of the wealth.

** Gods
The theory of mind provides six meanings for the word God,
all of which conform in one or more ways to the traditional
uses of the word.

The *OGE-GOD* is the oge.

The *HOLY SPIRIT* is the mind hekergy principle.

The *DEIFIED TEACHER* is the oge-person of a revered religious teacher.

The *PANACEA GOD* is a prejudice.

The *PHILOSOPHER'S GOD* is the noumenal world.

The *PSYCHOHELIOS* is the god of the mystics, the god of truth.

** Rational Mind

*CREATIVITY* is the talent for novel, original, hekergy increase.

A *GENIUS* is anyone with exceptional creativity.

*INTELLIGENCE* is the capacity to rearrange ideas rationally.

The *PSYCHOHELIOS* is that part of the ego that is wholly
rationally ordered.

The *SUPRARATIONAL* is the state of a noumenal mind that 
has maximum possible emergent hekergy.

The *ETHICAL* is anything that moves the individual towards
the suprarational.

*** Illusions of Irrationality
Some of the strangeness of the suprarational comes from
the illusions of irrationality, of which there are at
least ten.

- Illusion of Individuality 
- Illusion of Individual Death
- Everything concrete is illusory
- Illusion of one's own empirical body
- Illusion of subjective coordinate space
- Illusion of chance
- Illusion of free will
- Illusion of good/evil
- Illusion of the sensation of the passage of time
- No intrinsic sets or contingent sets in the world.

In conclusion, because of the nature of intensional
mathematics, of the psychohelios, and of the noumenal
world, we can say that mathematics, theoretical science,
metaphysics, ethics, and theology are ultimately all
the same quest for suprarational truth. And all of 
them, if properly done, are like the present work in
having cascading emergence of definitions and
explanations-- in having intensional meaning. 

* References
