Relation/Mind.html

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> The Oge </h3>
<div class="outline-text-3" id="text-2.2">

<p>Among the irrational features of mind which prevent knowledge
of the best of all intensional mathematical systems are:
</p>
<ul>
<li>
Internal Conflict 
</li>
<li>
Social Pressures

</li>
</ul>

<p>Both of these require the concept of oge for their
explanation.
</p>
<p>
The <b>OGE</b> (rhymes with <i>bogey</i>) is a second agent in the
noumenal mind which grows out of mid-memories of other
people; as such it represents, and acts on behalf of, society.
</p>
<p>
<b>APPROVAL</b> is evaluation of an action as hekergy increasing;
<b>DISAPPROVAL</b> is evaluation of it as hekergy decreasing.
</p>
<p>
<b>INTROJECTION</b> is the incorporation of a proposition into
the oge, thereby making it an oge-belief, as a result of
another person asserting this proposition in the hearing
of the ego.
</p>
<p>
The <b>MORAL</b> is any increase in the hekergy of society,
and hence of the oge.
</p>
<p>
<b>GUILT</b>, <b>SHAME</b>, <b>EMBARASSMENT</b> and <b>CONSCIENCE</b> are
feelings produced in the ego by the oge.
</p>
<p>
<b>CONFLICT</b> occurs when there are two agents having
mutually exclusive goals in a common situation.
</p>
<p>
An <b>OGE-INHIBITIION</b> is the prevention, by the oge,
of an action willed by the ego. An <b>EGO-INHIBITION</b>
is the prevention, by the ego, of an action willed
by the oge. A <b>TABOO</b> is a very strong oge-inhibition.
</p>
<p>
An <b>OGE-COMPULSION</b> is the forcing, by the oge, of
an action against the will of the ego; an 
<b>EGO-COMPULSION</b> is the forcing, by the ego, of
an action against the will of the oge.
</p>
<p>
An <b>OGE-PERSON</b> is a set of mid-memories of a
particular noumenal person, in the oge.
</p>
<p>
<b>GOOD</b> is hekergy increase.
</p>
<p>
<b>EVIL</b> is hekergy decrease.
</p>
<p>
<b>LOVE</b> is a willingness to raise the hekergy of
another person, unconditionally.
</p>
<p>
<b>HATE</b> is a willingness to lower the hekergy of
another person, unconditionally.
</p>
<p>
The <b>TOP (HIGH) EGO</b> is the good pole of the ego.
</p>
<p>
The <b>BOTTOM (LOW) EGO</b> the evil pole of the ego.
</p>
<p>
<b>MATURATION</b> of agents is hekergy increase.
</p>
<p>
<b>IDENTIFICATION</b> occurs when an oge-person, or a
group of them, becomes joined to the ego.
</p>
<p>
<b>INCLINATION-DUTY CONFLICT</b> is conflict between the
ego and the public portion of the oge.
</p>
<p>
<b>NEUROTIC CONFLICT</b> is conflict between the ego and
private portions of the oge.
</p>
<p>
<b>NOUMENAL POSSESSION</b> (<b>OWNERSHIP</b>) is an emergent
relation between a noumenal person or group of
noumenal people (the owner/s), and a noumenal object,
characterised by control of the object by the owner,
and lack of such control by non-owners.
</p>
<p>
<b>NOUMENAL WEALTH</b> is the emergent relation between
the hekergy of a noumenal object and a noumenal need
of the possessor of the wealth.
</p>
<p>
<b>MATERIAL WEALTH</b> is the emergent relation between the
hekergy of a material&ndash;that is,empirical&ndash;object and
an empirical need of the possessor of the wealth.
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Gods </h3>
<div class="outline-text-3" id="text-2.3">

<p>The theory of mind provides six meanings for the word God,
all of which conform in one or more ways to the traditional
uses of the word.
</p>
<p>
The <b>OGE-GOD</b> is the oge.
</p>
<p>
The <b>HOLY SPIRIT</b> is the mind hekergy principle.
</p>
<p>
The <b>DEIFIED TEACHER</b> is the oge-person of a revered religious teacher.
</p>
<p>
The <b>PANACEA GOD</b> is a prejudice.
</p>
<p>
The <b>PHILOSOPHER'S GOD</b> is the noumenal world.
</p>
<p>
The <b>PSYCHOHELIOS</b> is the god of the mystics, the god of truth.
</p>
</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Rational Mind </h3>
<div class="outline-text-3" id="text-2.4">


<p>
<b>CREATIVITY</b> is the talent for novel, original, hekergy increase.
</p>
<p>
A <b>GENIUS</b> is anyone with exceptional creativity.
</p>
<p>
<b>INTELLIGENCE</b> is the capacity to rearrange ideas rationally.
</p>
<p>
The <b>PSYCHOHELIOS</b> is that part of the ego that is wholly
rationally ordered.
</p>
<p>
The <b>SUPRARATIONAL</b> is the state of a noumenal mind that 
has maximum possible emergent hekergy.
</p>
<p>
The <b>ETHICAL</b> is anything that moves the individual towards
the suprarational.
</p>
<ul>
<li id="sec-2.4.1">Illusions of Irrationality <br/>
Some of the strangeness of the suprarational comes from
the illusions of irrationality, of which there are at
least ten.

<ul>
<li>
Illusion of Individuality 
</li>
<li>
Illusion of Individual Death
</li>
<li>
Everything concrete is illusory
</li>
<li>
Illusion of one's own empirical body
</li>
<li>
Illusion of subjective coordinate space
</li>
<li>
Illusion of chance
</li>
<li>
Illusion of free will
</li>
<li>
Illusion of good/evil
</li>
<li>
Illusion of the sensation of the passage of time
</li>
<li>
No intrinsic sets or contingent sets in the world.

</li>
</ul>

<p>In conclusion, because of the nature of intensional
mathematics, of the psychohelios, and of the noumenal
world, we can say that mathematics, theoretical science,
metaphysics, ethics, and theology are ultimately all
the same quest for suprarational truth. And all of 
them, if properly done, are like the present work in
having cascading emergence of definitions and
explanations&ndash; in having intensional meaning. 
</p>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References </h2>
<div class="outline-text-2" id="text-3">

</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-08-29 Thu</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
